nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.c
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_clock.h"
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

#define FRO0_DEFAULT_CLOCK_FREQ 300000000U
#define FRO1_MAX_CLOCK_FREQ     192000000U
#define FRO2_DEFAULT_CLOCK_FREQ 196000000U

#define FRO_MIN_CLOCK_FREQ 150000000U
#define FRO_MAX_CLOCK_FREQ 300000000U

/*******************************************************************************
 * Variables
 ******************************************************************************/
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
/* Array of LPUART peripheral base address. */
static FRO_Type *const s_froBases[]   = FRO_BASE_PTRS;
volatile uint32_t g_senseAudioClkFreq = 0U;
#endif

/* External XTAL (OSC) clock frequency. */
volatile uint32_t g_xtalFreq = 24000000U;
/* External CLK_IN pin clock frequency. */
volatile uint32_t g_clkinFreq = 0U;
/* External MCLK IN clock frequency. */
volatile uint32_t g_mclkFreq = 0U;
/* External 32 kHz input clock  pin clock frequency. */
volatile uint32_t g_32kClkinFreq = 0U;

/*******************************************************************************
 * Code
 ******************************************************************************/
void CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t index   = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    uint32_t bitMask = 1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk);

    switch (index)
    {
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
        case CLK_CTL0_PSCCTL0:
            CLKCTL0->PSCCTL0_SET = bitMask;
            while ((CLKCTL0->PSCCTL0 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL0_PSCCTL1:
            CLKCTL0->PSCCTL1_SET = bitMask;
            while ((CLKCTL0->PSCCTL1 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL0_PSCCTL2:
            CLKCTL0->PSCCTL2_SET = bitMask;
            while ((CLKCTL0->PSCCTL2 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL0_PSCCTL3:
            CLKCTL0->PSCCTL3_SET = bitMask;
            while ((CLKCTL0->PSCCTL3 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL0_PSCCTL4:
            CLKCTL0->PSCCTL4_SET = bitMask;
            while ((CLKCTL0->PSCCTL4 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL0_PSCCTL5:
            CLKCTL0->PSCCTL5_SET = bitMask;
            while ((CLKCTL0->PSCCTL5 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL3_PSCCTL0:
            CLKCTL3->PSCCTL0_COMP_SET = bitMask;
            while ((CLKCTL3->PSCCTL0_COMP & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL4_PSCCTL0:
            CLKCTL4->PSCCTL0_MEDIA_SET = bitMask;
            while ((CLKCTL4->PSCCTL0_MEDIA & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL4_PSCCTL1:
            CLKCTL4->PSCCTL1_MEDIA_SET = bitMask;
            while ((CLKCTL4->PSCCTL1_MEDIA & bitMask) == 0U)
            {
            }
            break;
        case SYSCON0_SEC_CLK_CTRL:
            SYSCON0->SEC_CLK_CTRL_SET = bitMask;
            while ((SYSCON0->SEC_CLK_CTRL & bitMask) == 0U)
            {
            }
            break;
        case CLKCTL0_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL0->ONE_SRC_CLKSLICE_ENABLE |= bitMask;
            while ((CLKCTL0->ONE_SRC_CLKSLICE_ENABLE & bitMask) == 0U)
            {
            }
            break;
        case CLKCTL3_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_COMP |= bitMask;
            while ((CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_COMP & bitMask) == 0U)
            {
            }
            break;
        case CLKCTL4_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL4->ONE_SRC_CLKSLICE_ENABLE |= bitMask;
            while ((CLKCTL4->ONE_SRC_CLKSLICE_ENABLE & bitMask) == 0U)
            {
            }
            break;
#else  /* Sense domain */
        case CLK_CTL1_PSCCTL0:
            CLKCTL1->PSCCTL0_SET = bitMask;
            while ((CLKCTL1->PSCCTL0 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL1_PSCCTL1:
            CLKCTL1->PSCCTL1_SET = bitMask;
            while ((CLKCTL1->PSCCTL1 & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL3_PSCCTL0:
            CLKCTL3->PSCCTL0_SENS_SET = bitMask;
            while ((CLKCTL3->PSCCTL0_SENS & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL4_PSCCTL0:
            CLKCTL4->PSCCTL0_SENS_SET = bitMask;
            while ((CLKCTL4->PSCCTL0_SENS & bitMask) == 0U)
            {
            }
            break;
        case CLK_CTL4_PSCCTL1:
            CLKCTL4->PSCCTL1_SENS_SET = bitMask;
            while ((CLKCTL4->PSCCTL1_SENS & bitMask) == 0U)
            {
            }
            break;
        case CLKCTL3_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_SENSE |= bitMask;
            while ((CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_SENSE & bitMask) == 0U)
            {
            }
            break;
        case CLKCTL4_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL4->ONE_SRC_CLKSLICE_ENABLE_SENSE |= bitMask;
            while ((CLKCTL4->ONE_SRC_CLKSLICE_ENABLE_SENSE & bitMask) == 0U)
            {
            }
            break;
#endif /* FSL_CLOCK_DRIVER_COMPUTE */
        case CLK_CTL2_PSCCTL0:
            CLKCTL2->PSCCTL0_SET = bitMask;
            while ((CLKCTL2->PSCCTL0 & bitMask) == 0U)
            {
            }
            break;
        case SYSCON3_SEC_CLK_CTRL:
            SYSCON3->SEC_CLK_CTRL_SET = bitMask;
            while ((SYSCON3->SEC_CLK_CTRL & bitMask) == 0U)
            {
            }
            break;
        default:
            /* Should not go here. */
            assert(false);
            break;
    }
}

