nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.c
void CLOCK_DisableClock(clock_ip_name_t clk)
{
    uint32_t index = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    switch (index)
    {
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
        case CLK_CTL0_PSCCTL0:
            CLKCTL0->PSCCTL0_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL0_PSCCTL1:
            CLKCTL0->PSCCTL1_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL0_PSCCTL2:
            CLKCTL0->PSCCTL2_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL0_PSCCTL3:
            CLKCTL0->PSCCTL3_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL0_PSCCTL4:
            CLKCTL0->PSCCTL4_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL0_PSCCTL5:
            CLKCTL0->PSCCTL5_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL3_PSCCTL0:
            CLKCTL3->PSCCTL0_COMP_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL4_PSCCTL0:
            CLKCTL4->PSCCTL0_MEDIA_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL4_PSCCTL1:
            CLKCTL4->PSCCTL1_MEDIA_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case SYSCON0_SEC_CLK_CTRL:
            SYSCON0->SEC_CLK_CTRL_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLKCTL0_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL0->ONE_SRC_CLKSLICE_ENABLE &= ~(1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLKCTL3_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_COMP &= ~(1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLKCTL4_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL4->ONE_SRC_CLKSLICE_ENABLE &= ~(1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
#else
        case CLK_CTL1_PSCCTL0:
            CLKCTL1->PSCCTL0_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL1_PSCCTL1:
            CLKCTL1->PSCCTL1_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL3_PSCCTL0:
            CLKCTL3->PSCCTL0_SENS_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL4_PSCCTL0:
            CLKCTL4->PSCCTL0_SENS_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLK_CTL4_PSCCTL1:
            CLKCTL4->PSCCTL1_SENS_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLKCTL3_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL3->ONE_SRC_CLKSLICE_ENABLE_SENSE &= ~(1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case CLKCTL4_ONE_SRC_CLKSLICE_ENABLE:
            CLKCTL4->ONE_SRC_CLKSLICE_ENABLE_SENSE &= ~(1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
#endif
        case CLK_CTL2_PSCCTL0:
            CLKCTL2->PSCCTL0_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        case SYSCON3_SEC_CLK_CTRL:
            SYSCON3->SEC_CLK_CTRL_CLR = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
            break;
        default:
            /* Should not go here. */
            assert(false);
            break;
    }
}

/* Clock Selection for IP */
/**
 * brief   Configure the clock selection muxes.
 * param   connection : Clock to be configured.
 * return  Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection)
{
    volatile uint32_t *pClkSel;

    switch (((uint32_t)connection) & 0xE0000000U)
    {
        case CLKCTL4_INDEX:
            pClkSel = CLKCTL_TUPLE_REG(CLKCTL4, connection);
            break;
        case CLKCTL3_INDEX:
            pClkSel = CLKCTL_TUPLE_REG(CLKCTL3, connection);
            break;
        case CLKCTL2_INDEX:
            pClkSel = CLKCTL_TUPLE_REG(CLKCTL2, connection);
            break;
#if defined(FSL_CLOCK_DRIVER_SENSE)
        case CLKCTL1_INDEX:
            pClkSel = CLKCTL_TUPLE_REG(CLKCTL1, connection);
            break;
#else
        case CLKCTL0_INDEX:
            pClkSel = CLKCTL_TUPLE_REG(CLKCTL0, connection);
            break;
#endif
        default:
            pClkSel = NULL;
            break;
    }

    if (pClkSel != NULL)
    {
        if (((uint32_t)connection & CLK_MUX_DISABLE_OUTPUT_MASK) != 0U) /* For muxes with SEL_EN bit*/
        {
            *pClkSel = (*pClkSel & 0xFFFFFF8UL) | CLKCTL_TUPLE_SEL(connection);
        }
        else
        {
            *pClkSel = (*pClkSel & 0xFFFFFFCUL) | CLKCTL_TUPLE_SEL(connection) | 0x4U;
        }
    }
    else
    {
        /* Unreachable */
        assert(false);
    }
}

/* Set IP Clock divider */
/**
 * brief   Setup peripheral clock dividers.
 * param   div_name    : Clock divider name
 * param   divider     : Value to be divided. Divided clock frequency = Undivided clock frequency / divider.
 * return  Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divider)
{
    volatile uint32_t *pClkDiv = NULL;

    switch (((uint32_t)div_name) & 0xE0000000U)
    {
        case CLKCTL4_INDEX:
            pClkDiv = CLKCTL_TUPLE_REG(CLKCTL4, div_name);
            break;
        case CLKCTL3_INDEX:
            pClkDiv = CLKCTL_TUPLE_REG(CLKCTL3, div_name);
            break;
        case CLKCTL2_INDEX:
            pClkDiv = CLKCTL_TUPLE_REG(CLKCTL2, div_name);
            break;
#if defined(FSL_CLOCK_DRIVER_SENSE)
        case CLKCTL1_INDEX:
            pClkDiv = CLKCTL_TUPLE_REG(CLKCTL1, div_name);
            break;
#else
        case CLKCTL0_INDEX:
            pClkDiv = CLKCTL_TUPLE_REG(CLKCTL0, div_name);
            break;
#endif
        default:
            /* Should not go here. */
            assert(false);
            break;
    }

        /* Reset the divider counter */
#if defined(FSL_CLOCK_DRIVER_SENSE)
    if (div_name != kCLOCK_DivSenseMainClk)
#endif
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    if ((div_name != kCLOCK_DivCmptMainClk) && (div_name != kCLOCK_DivSenseMainClk))
#endif
    {
        *pClkDiv |= 1UL << 29U;
    }

