nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.c
    assert(instance < ARRAY_SIZE(s_froBases));

    return instance;
}
#endif

static uint32_t CLOCK_CalFroFreq(FRO_Type *base)
{
    uint32_t freq    = 0U;
    bool enabled     = false;
    uint32_t refFreq = 0U;

#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    assert(base != FRO1);
    enabled = ((SLEEPCON0->RUNCFG & ((uint32_t)SLEEPCON0_RUNCFG_FRO0_PD_MASK << CLOCK_FroGetInstance(base))) != 0U) ?
                  false :
                  true;
#else
    enabled = ((SLEEPCON1->RUNCFG & SLEEPCON1_RUNCFG_FRO2_PD_MASK) != 0U) ? false : true;
#endif
    refFreq = (g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq;

    if ((base->CSR.RW & FRO_CSR_FROEN_MASK) != 0U || enabled)
    {
        if (base == FRO2)
        {
            if ((base->TEXPCNT.RW & FRO_TEXPCNT_TEXPCNT_MASK) != 0u)
            {
                freq = ((uint32_t)((uint64_t)(base->TRIMCNT.RW) *
                                   ((uint64_t)refFreq / (uint64_t)((base->CNFG1.RW & FRO_CNFG1_REFDIV_MASK) + 1UL)) /
                                   (uint64_t)((base->CNFG1.RW & FRO_CNFG1_RFCLKCNT_MASK) >> FRO_CNFG1_RFCLKCNT_SHIFT)));
            }
            else
            {
                freq = FRO2_DEFAULT_CLOCK_FREQ;
            }
        }
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
        else
        {
            if ((base->TEXPCNT.RW & FRO_TEXPCNT_TEXPCNT_MASK) != 0u)
            {
                freq = ((uint32_t)((uint64_t)(base->TRIMCNT.RW) *
                                   ((uint64_t)refFreq / (uint64_t)((base->CNFG1.RW & FRO_CNFG1_REFDIV_MASK) + 1UL)) /
                                   (uint64_t)((base->CNFG1.RW & FRO_CNFG1_RFCLKCNT_MASK) >> FRO_CNFG1_RFCLKCNT_SHIFT)));
            }
            else
            {
                freq = FRO0_DEFAULT_CLOCK_FREQ;
            }
        }
#endif
    }
    else
    {
        freq = 0U; /* FRO is disabled. */
    }

    return freq;
}

uint32_t CLOCK_GetFroClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    switch (id)
    {
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
        case 0U:
            freq = CLOCK_CalFroFreq(FRO0);
            break;
#endif
        case 1U:
            freq = FRO1_MAX_CLOCK_FREQ;
            break;
        case 2U:
            freq = CLOCK_CalFroFreq(FRO2);
            break;
        default:
            /* Added comments to prevent the violation of MISRA C-2012 rule. */
            break;
    }

    return freq;
}

uint32_t CLOCK_GetFroFlags(FRO_Type *base)
{
    uint32_t flags = 0U;

    flags = base->CSR.RW & (FRO_CSR_TUNE_ERR_MASK | FRO_CSR_LOL_ERR_MASK | FRO_CSR_TRUPREQ_MASK |
                            FRO_CSR_TUNEONCE_DONE_MASK | FRO_CSR_TRIM_LOCK_MASK);
    return flags;
}

void CLOCK_EnableFroClkOutput(FRO_Type *base, uint32_t divOutEnable)
{
    if (divOutEnable != 0U)
    {
        /* Wait clock ready. */
        if (base == FRO2)
        {
            while ((CLKCTL3->FRO2CLKSTATUS & CLKCTL3_FRO2CLKSTATUS_CLK_OK_MASK) == 0U)
            {
            }
        }
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
        else if (base == FRO0)
        {
            while ((CLKCTL0->FRO01CLKSTATUS & CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK) == 0U)
            {
            }
        }
        else
        {
            while ((CLKCTL0->FRO01CLKSTATUS & CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK_MASK) == 0U)
            {
            }
        }
#else
        else
        {
            /* Intentional empty. */
        }
#endif /* FSL_CLOCK_DRIVER_COMPUTE */
    }
    else
    {
        /* Intentional empty. */
    }

    base->CSR.CLR = ((base->CSR.RW & FRO_CSR_CLKGATE_MASK) ^ divOutEnable) & FRO_CSR_CLKGATE_MASK;
    base->CSR.SET = divOutEnable;
}

status_t CLOCK_EnableFroAutoTuning(FRO_Type *base, const clock_fro_config_t *config, bool enable)
{
    uint32_t refFreq    = 0U;
    uint32_t tempCnt    = 0U;
    uint32_t trim1Delay = 0U;
    uint32_t trim2Delay = 0U;
    uint32_t freqkHZ    = 0U;
    status_t ret        = kStatus_Success;

    if (enable)
    {
        /* Check parameter. FRO1 192MHz, FRO0,2 150MHz ~ 300MHz*/
        if ((config->targetFreq < FRO_MIN_CLOCK_FREQ) || (config->targetFreq > FRO_MAX_CLOCK_FREQ) ||
            (config->refDiv == 0U))
        {
            ret = kStatus_InvalidArgument;
        }
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
        else if ((base == FRO1) && (config->targetFreq != FRO1_MAX_CLOCK_FREQ))
        {
            ret = kStatus_InvalidArgument;
        }
#endif
        else
        {
            /* Do nothing. */
        }

        if (ret == kStatus_Success)
        {
            /* Both FRO_PD in SLEEPCON and FROEN can power up FRO, clear FROEN for only using FRO_PD to control it's
             * power. */
            base->CSR.CLR = FRO_CSR_FROEN_MASK | FRO_CSR_TREN_MASK | FRO_CSR_TRUPEN_MASK;

            refFreq = CLOCK_GetXtalInClkFreq() / (config->refDiv);
            freqkHZ = config->targetFreq / 1000U;

            tempCnt = (10U * refFreq + freqkHZ - 1U) /
                      freqkHZ; /* REFCLKCNT = 10000 * divided reference clock / FRO target frequency. */
            base->CNFG1.RW =
                config->enableInt | FRO_CNFG1_RFCLKCNT(tempCnt) | FRO_CNFG1_REFDIV((uint32_t)config->refDiv - 1UL);

            /* TEXPCNT */
            tempCnt          = (uint32_t)((uint64_t)config->targetFreq * tempCnt / refFreq);
            base->TEXPCNT.RW = FRO_TEXPCNT_TEXPCNT(tempCnt) | FRO_TEXPCNT_TEXPCNT_RANGE(config->range);

            trim1Delay     = refFreq / 1000000UL * (uint32_t)config->trim1DelayUs;
            trim2Delay     = refFreq / 1000000UL * (uint32_t)config->trim2DelayUs;
            base->CNFG2.RW = FRO_CNFG2_TRIM1_DELAY(trim1Delay == 0U ? 1U : trim1Delay) |
                             FRO_CNFG2_TRIM2_DELAY(trim2Delay == 0U ? 1U : trim2Delay);

            if (config->coarseTrimEn)
            {
                base->CSR.SET = FRO_CSR_COARSEN_MASK;
            }
            else
            {
                base->CSR.CLR = FRO_CSR_COARSEN_MASK;
            }
            /* Enable FRO close loop mode. */
            base->CSR.SET = FRO_CSR_TREN_MASK | FRO_CSR_TRUPEN_MASK;
        }
        else
        {
            /* Do nothing. */
        }

        return ret;
    }
    else
    {
        base->CSR.CLR = FRO_CSR_TREN_MASK | FRO_CSR_TRUPEN_MASK;
        ret           = kStatus_Success;
    }

    return ret;
}

void CLOCK_EnableFroClkFreq(FRO_Type *base, uint32_t targetFreq, uint32_t divOutEnable)
{
    const clock_fro_config_t froAutotrimCfg = {
        .targetFreq   = targetFreq,
        .range        = 50U, /* For about 0.5% deviation. */
        .trim1DelayUs = 15U,
        .trim2DelayUs = 150U,
        .refDiv       = 1U,
        .enableInt    = 0U,
        .coarseTrimEn = true,
    };
    (void)CLOCK_EnableFroClkFreqCloseLoop(base, &froAutotrimCfg, divOutEnable);
    (void)CLOCK_EnableFroAutoTuning(base, &froAutotrimCfg, false);
}

void CLOCK_ConfigFroTrim(FRO_Type *base, uint16_t trimVal)
{
    base->FROTRIM.RW = (base->FROTRIM.RW & ~(FRO_FROTRIM_COARSE_TRIM_MASK | FRO_FROTRIM_FINE_TRIM_MASK)) |
                       FRO_FROTRIM_COARSE_TRIM(((uint32_t)trimVal & 0xF80U) >> 0x7U) |
                       FRO_FROTRIM_FINE_TRIM((uint32_t)trimVal & 0x7FU);
}

status_t CLOCK_EnableFroClkFreqCloseLoop(FRO_Type *base, const clock_fro_config_t *config, uint32_t divOutEnable)
{
    status_t ret   = kStatus_Success;
    uint32_t flags = 0U;

    /*Power up FRO */
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    SLEEPCON0->RUNCFG_CLR = (uint32_t)SLEEPCON0_RUNCFG_FRO0_PD_MASK << CLOCK_FroGetInstance(base);
#else
    SLEEPCON1->RUNCFG_CLR = (uint32_t)SLEEPCON1_RUNCFG_FRO2_PD_MASK;
#endif

    /* Disable output before changeing frequency. */
    CLOCK_EnableFroClkOutput(base, 0U);
    ret = CLOCK_EnableFroAutoTuning(base, config, true);

    if (ret == kStatus_Success)
    {
        /* Polling wait tune finish. */
        do
        {
            flags = CLOCK_GetFroFlags(base);

