nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.c
    switch (CLKCTL0->VDD2COMBASECLKSEL & CLKCTL0_VDD2COMBASECLKSEL_SEL_MASK)
    {
        case CLKCTL0_VDD2COMBASECLKSEL_SEL(0U):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;
        case CLKCTL0_VDD2COMBASECLKSEL_SEL(1U):
            freq = CLOCK_GetFroClkFreq(1U);
            break;
        case CLKCTL0_VDD2COMBASECLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;
        case CLKCTL0_VDD2COMBASECLKSEL_SEL(3U):
            freq = CLOCK_GetLpOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetComputeAudioClkFreq(void)
{
    uint32_t freq = 0U;

    switch (CLKCTL0->AUDIOVDD2CLKSEL & CLKCTL0_AUDIOVDD2CLKSEL_SEL_MASK)
    {
        case CLKCTL0_AUDIOVDD2CLKSEL_SEL(0U):
            freq = CLOCK_GetMclkInClkFreq();
            break;
        case CLKCTL0_AUDIOVDD2CLKSEL_SEL(1U):
            freq = CLOCK_GetXtalInClkFreq();
            break;
        case CLKCTL0_AUDIOVDD2CLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(2U) / 8U;
            break;
        case CLKCTL0_AUDIOVDD2CLKSEL_SEL(3U):
            freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd3);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetSenseAudioClkFreq(void)
{
    return g_senseAudioClkFreq;
}

/* Get FCCLK Clk frequency */
uint32_t CLOCK_GetFCClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;
    uint32_t clkDiv = 0U;
    bool selEn      = false;

    assert(id <= 3U);

    clkSel = CLKCTL0->FLEXCOMM[id].FCCLKSEL & CLKCTL0_FCCLKSEL_SEL_MASK;
    selEn  = (CLKCTL0->FLEXCOMM[id].FCCLKSEL & CLKCTL0_FCCLKSEL_SEL_EN_MASK) == CLKCTL0_FCCLKSEL_SEL_EN_MASK;
    clkDiv = (CLKCTL0->FLEXCOMM[id].FCCLKDIV & CLKCTL0_FCCLKDIV_DIV_MASK) >> CLKCTL0_FCCLKDIV_DIV_SHIFT;

    if (selEn)
    {
        switch (clkSel)
        {
            case CLKCTL0_FCCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_FCCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_FCCLKSEL_SEL(2):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd3);
                break;

            case CLKCTL0_FCCLKSEL_SEL(3):
                freq = CLOCK_GetSysOscFreq();
                break;
            default:
                freq = 0U;
                break;
        }
    }
    else
    {
        freq = 0U;
    }

    return (freq / (clkDiv + 1U));
}

uint32_t CLOCK_GetComputeMainClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL0->MAINCLKSEL) & CLKCTL0_MAINCLKSEL_SEL_MASK)
    {
        case CLKCTL0_MAINCLKSEL_SEL(0):
            freq = CLOCK_GetComputeBaseClkFreq();
            break;

        case CLKCTL0_MAINCLKSEL_SEL(1):
            freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL0_MAINCLKSEL_SEL(2):
            freq = CLOCK_GetFroClkFreq(0U);
            break;

        case CLKCTL0_MAINCLKSEL_SEL(3):
            freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd1);
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ((CLKCTL0->MAINCLKDIV & CLKCTL0_MAINCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetHifi4ClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->DSPCPUCLKSEL & CLKCTL0_DSPCPUCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->DSPCPUCLKSEL) & CLKCTL0_DSPCPUCLKSEL_SEL_MASK)
        {
            case CLKCTL0_DSPCPUCLKSEL_SEL(0):
                freq = CLOCK_GetComputeDspBaseClkFreq();
                break;

            case CLKCTL0_DSPCPUCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;

            case CLKCTL0_DSPCPUCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_DSPCPUCLKSEL_SEL(3):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd1);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->DSPCPUCLKDIV & CLKCTL0_DSPCPUCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetSenseBaseClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;
    clkSel          = CLKCTL3->SENSEBASECLKSEL & CLKCTL3_SENSEBASECLKSEL_SEL_MASK;

    /* Read again to avoid glitch. */
    if (clkSel == (CLKCTL3->SENSEBASECLKSEL & CLKCTL3_SENSEBASECLKSEL_SEL_MASK))
    {
        switch (clkSel)
        {
            case CLKCTL3_SENSEBASECLKSEL_SEL(0U):
                freq = CLOCK_GetFroClkFreq(1U) / 3U;
                break;
            case CLKCTL3_SENSEBASECLKSEL_SEL(1U):
                freq = CLOCK_GetFroClkFreq(1U);
                break;
            case CLKCTL3_SENSEBASECLKSEL_SEL(2U):
                freq = CLOCK_GetFroClkFreq(2U) / 3U;
                break;
            case CLKCTL3_SENSEBASECLKSEL_SEL(3U):
                freq = CLOCK_GetLpOscFreq();
                break;
            default:
                freq = 0U;
                break;
        }
    }

    return freq;
}

#endif /* FSL_CLOCK_DRIVER_COMPUTE */

#if defined(FSL_CLOCK_DRIVER_SENSE)
/*! @brief  Get Sense base clock frequency. */
uint32_t CLOCK_GetSenseBaseClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;
    clkSel          = CLKCTL1->SENSEBASECLKSEL & CLKCTL1_SENSEBASECLKSEL_SEL_MASK;

    switch (clkSel)
    {
        case CLKCTL1_SENSEBASECLKSEL_SEL(0U):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;
        case CLKCTL1_SENSEBASECLKSEL_SEL(1U):
            freq = CLOCK_GetFroClkFreq(1U);
            break;
        case CLKCTL1_SENSEBASECLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(2U) / 3U;
            break;
        case CLKCTL1_SENSEBASECLKSEL_SEL(3U):
            freq = CLOCK_GetLpOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetHifi1ClkFreq(void)
{
    uint32_t freq = 0U;

