nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.c
uint32_t CLOCK_GetWdtClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if (id == 0U)
    {
        if ((CLKCTL0->WWDT0FCLKSEL & CLKCTL0_WWDT0FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL0->WWDT0FCLKSEL & CLKCTL0_WWDT0FCLKSEL_SEL_MASK)
            {
                case CLKCTL0_WWDT0FCLKSEL_SEL(0):
                    freq = CLOCK_GetLpOscFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
        }
    }
    else if (id == 1U)
    {
        if ((CLKCTL0->WWDT1FCLKSEL & CLKCTL0_WWDT1FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL0->WWDT1FCLKSEL & CLKCTL0_WWDT1FCLKSEL_SEL_MASK)
            {
                case CLKCTL0_WWDT1FCLKSEL_SEL(0):
                    freq = CLOCK_GetLpOscFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
        }
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetSystickClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->SYSTICKFCLKSEL & CLKCTL0_SYSTICKFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch (CLKCTL0->SYSTICKFCLKSEL & CLKCTL0_SYSTICKFCLKSEL_SEL_MASK)
        {
            case CLKCTL0_SYSTICKFCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;
            case CLKCTL0_SYSTICKFCLKSEL_SEL(1):
                freq = CLOCK_GetLpOscFreq();
                break;
            case CLKCTL0_SYSTICKFCLKSEL_SEL(2):
                freq = CLOCK_GetWakeClk32KFreq();
                break;
            case CLKCTL0_SYSTICKFCLKSEL_SEL(3):
                freq = CLOCK_GetXtalInClkFreq();
                break;
            default:
                freq = 0U;
                break;
        }
    }
    return freq / ((CLKCTL0->SYSTICKFCLKDIV & CLKCTL0_SYSTICKFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetCTimerClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->CTIMERFCLKSEL[id] & CLKCTL0_CTIMERFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->CTIMERFCLKSEL[id]) & CLKCTL0_CTIMERFCLKSEL_SEL_MASK)
        {
            case CLKCTL0_CTIMERFCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_CTIMERFCLKSEL_SEL(1):
                freq = CLOCK_GetComputeAudioClkFreq();
                break;

            case CLKCTL0_CTIMERFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_CTIMERFCLKSEL_SEL(3):
                freq = CLOCK_GetWakeClk32KFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->CTIMERCLKDIV[id] & CLKCTL0_CTIMERCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetI3cClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->I3C01FCLKSEL & CLKCTL0_I3C01FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->I3C01FCLKSEL) & CLKCTL0_I3C01FCLKSEL_SEL_MASK)
        {
            case CLKCTL0_I3C01FCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_I3C01FCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_I3C01FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(1U) / 8U;
                break;

            case CLKCTL0_I3C01FCLKSEL_SEL(3):
                freq = CLOCK_GetSysOscFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->I3C01FCLKDIV & CLKCTL0_I3C01FCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetTrngClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->TRNGFCLKSEL & CLKCTL0_TRNGFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->TRNGFCLKSEL) & CLKCTL0_TRNGFCLKSEL_SEL_MASK)
        {
            case CLKCTL0_TRNGFCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_TRNGFCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(1U) / 2U;
                break;

            case CLKCTL0_TRNGFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(1U) / 8U;
                break;

            case CLKCTL0_TRNGFCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U) / 3U;
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->TRNGFCLKDIV & CLKCTL0_TRNGFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetTpiuClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->TPIUFCLKSEL & CLKCTL0_TPIUFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->TPIUFCLKSEL) & CLKCTL0_TPIUFCLKSEL_SEL_MASK)
        {
            case CLKCTL0_TPIUFCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_TPIUFCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;

            case CLKCTL0_TPIUFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_TPIUFCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(0U) / 6U;
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->TPIUCLKDIV & CLKCTL0_TPIUCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetSaiClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->SAI012FCLKSEL & CLKCTL0_SAI012FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->SAI012FCLKSEL) & CLKCTL0_SAI012FCLKSEL_SEL_MASK)
        {
            case CLKCTL0_SAI012FCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;

            case CLKCTL0_SAI012FCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(2U) / 8U;
                break;

            case CLKCTL0_SAI012FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_SAI012FCLKSEL_SEL(3):
                freq = CLOCK_GetComputeAudioClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->SAI012CLKDIV & CLKCTL0_SAI012CLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetClockOutClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->CLKOUTCLKSEL & CLKCTL0_CLKOUTCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL0->CLKOUTCLKSEL) & CLKCTL0_CLKOUTCLKSEL_SEL_MASK)
        {
            case CLKCTL0_CLKOUTCLKSEL_SEL(0):
                freq = CLOCK_GetVdd2ComBaseClkFreq();
                break;

            case CLKCTL0_CLKOUTCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;

            case CLKCTL0_CLKOUTCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL0_CLKOUTCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL0->CLKOUTCLKDIV & CLKCTL0_CLKOUTCLKDIV_DIV_MASK) + 1U);
}
#else  /* Sense domain. */
uint32_t CLOCK_GetUtickClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL1->UTICK1FCLKSEL & CLKCTL1_UTICK1FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch (CLKCTL1->UTICK1FCLKSEL & CLKCTL1_UTICK1FCLKSEL_SEL_MASK)
        {
            case CLKCTL1_UTICK1FCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;
            case CLKCTL1_UTICK1FCLKSEL_SEL(1):
                freq = CLOCK_GetLpOscFreq();
                break;
            case CLKCTL1_UTICK1FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;
            case CLKCTL1_UTICK1FCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U) / 2U;
                break;
            default:
                freq = 0U;
                break;
        }
    }
    return freq / ((CLKCTL1->UTICK1CLKDIV & CLKCTL1_UTICK1CLKDIV_DIV_MASK) + 1U);
}

